[
  {
    "image": "https://i.ibb.co/8jbKm6V/177040614.jpg",
    "estate_title": "Luxury Villa with Ocean View",
    "id": "1",
    "category": "Single-family homes",
    "description": "Stunning villa with panoramic ocean views, featuring modern architecture and luxurious amenities.",
    "deatailDescription": "Where the azure waters meet the horizon in an endless embrace, stands the epitome of opulence and tranquility - the Luxury Villa with Ocean View. Perched majestically atop a verdant cliff, this architectural marvel offers a symphony of elegance and natural beauty, creating an unparalleled retreat for those seeking the pinnacle of luxury. As you approach, a grand entrance welcomes you, adorned with lush tropical foliage and the soothing melody of cascading water features. Stepping inside, you are greeted by a spacious foyer, bathed in natural light filtering through floor-to-ceiling windows, offering the first glimpse of the breathtaking ocean vista beyond..",
    "price": "$1,500,000",
    "status": "Sale",
    "area": "4500 sq ft",
    "location": "Malibu, California",
    "facilities": ["living room", "swimming pool", "kitchen"]
  },
  {
    "image": "https://i.ibb.co/VH7HwzX/istockphoto-1354034892-1024x1024-transformed.jpg",
    "estate_title": "Cozy Suburban Home",
    "id": "2",
    "category": "Single-family homes",
    "description": "Charming family home located in a peaceful suburban neighborhood, perfect for raising children.",
    "deatailDescription": "Nestled in the heart of a serene suburban neighborhood lies a charming abode that exudes warmth and tranquility. As you approach, a neatly manicured lawn welcomes you, the emerald green grass dotted with vibrant blooms that sway gently in the soft breeze. The scent of freshly cut grass mingles with the sweet perfume of blossoms, creating an atmosphere of natural harmony.The exterior of the house, painted in a soothing shade of ivory, radiates timeless elegance. A quaint front porch adorned with wicker furniture invites you to pause and soak in the peaceful ambiance. Hanging baskets overflowing with cascades of flowers add a touch of whimsy, while the gentle creak of the porch swing promises moments of relaxation and reflection.",
    "price": "$400,000",
    "status": "Sale",
    "area": "2500 sq ft",
    "location": "Sunnyvale, California",
    "facilities": ["living room", "backyard", "garage"]
  },
  {
    "image": "https://i.ibb.co/7yHkJQ1/301520287.jpg",
    "estate_title": "Modern City Apartment",
    "id": "3",
    "category": "Apartments",
    "description": "Sleek and stylish apartment in the heart of the city, offering convenience and contemporary living.",
    "deatailDescription": "This modern apartment embodies urban living at its finest. Located in a sleek high-rise building, it offers a sanctuary of contemporary comfort amidst the bustling energy of the metropolis.Upon entering, you are greeted by an expansive living space adorned with clean lines, chic furnishings, and an abundance of natural light streaming through floor-to-ceiling windows. The open-concept design seamlessly integrates the living, dining, and kitchen areas, creating an inviting atmosphere perfect for both relaxation and entertaining.",
    "price": "$800,000",
    "status": "Sale",
    "area": "1200 sq ft",
    "location": "Manhattan, New York",
    "facilities": ["living room", "gym", "rooftop terrace"]
  },
  {
    "image": "https://i.ibb.co/QCdF2pP/303497357-187807806963412-934476195519526862-n.jpg",
    "estate_title": "Riverside Retreat",
    "id": "4",
    "category": "Vacation Rentals",
    "description": "Tranquil retreat nestled along the riverbank, surrounded by lush greenery and wildlife.",
    "deatailDescription": "Riverside Retreat is not merely a home; it's an invitation to embrace serenity and reconnect with nature's rhythms. Situated on the tranquil banks of the meandering river, this haven offers a harmonious blend of rustic charm and modern comfort.Approaching the retreat, a picturesque scene unfolds before you. The lush greenery envelops the property, creating a natural cocoon of tranquility. A quaint wooden bridge spans the river, welcoming you into this idyllic sanctuary. As you step onto the grounds, the soothing melody of flowing water serves as a soothing backdrop to your arrival.",
    "price": "$600/night",
    "status": "Rent",
    "area": "3000 sq ft",
    "location": "Boulder, Colorado",
    "facilities": ["living room", "fireplace", "garden"]
  },
  {
    "image": "https://i.ibb.co/hDv3cJD/sean-mcgee-Yzai-Sw13-SU-unsplash.jpg",
    "estate_title": "Seaside Cottage",
    "id": "5",
    "category": "Vacation Rentals",
    "description": "Quaint cottage steps away from the beach, perfect for a relaxing getaway.",
    "deatailDescription": "The Seaside Cottage embodies the essence of tranquility and coastal charm. As you approach along the winding path bordered by swaying beach grass, the weathered cedar shingles of the cottage come into view, their soft hues blending seamlessly with the natural landscape.The exterior is a picture of coastal elegance, with its quaint white picket fence and welcoming porch adorned with weather-worn Adirondack chairs, where one can sit and soak in the salty breeze while gazing out at the endless expanse of the sea.",
    "price": "$300/night",
    "status": "Rent",
    "area": "1500 sq ft",
    "location": "Santa Cruz, California",
    "facilities": ["living room", "deck", "ocean view"]
  },
  {
    "image": "https://i.ibb.co/dJKQvYW/1550-Light-Brown-and-Orange-Real-Estate-Open-House-Flyer-3.jpg",
    "estate_title": "Mountain Chalet",
    "id": "6",
    "category": "Vacation Rentals",
    "description": "Charming chalet nestled in the mountains, offering stunning views and access to outdoor activities.",
    "deatailDescription": "Where emerald forests kiss the sky and rugged peaks stand sentinel, lies a mountain chalet home of unparalleled charm and serenity.Approaching along a winding mountain road, one is immediately struck by the graceful silhouette of the chalet, its timber facade blending harmoniously with the natural surroundings. The scent of pine hangs in the crisp mountain air, mingling with the faint aroma of wood smoke from the chimney, evoking a sense of warmth and comfort.",
    "price": "$400/night",
    "status": "Rent",
    "area": "2800 sq ft",
    "location": "Aspen, Colorado",
    "facilities": ["living room", "fireplace", "ski-in/ski-out"]
  },
  {
    "image": "https://i.ibb.co/d2zPfGr/1-ecohome-FEAT.jpg",
    "estate_title": "Eco-Friendly Townhouse",
    "id": "7",
    "category": "Townhouses",
    "description": "Modern townhouse designed with sustainability in mind, featuring energy-efficient appliances and solar panels.",
    "deatailDescription": "Eco-friendly townhouse stands as a beacon of sustainable living and modern comfort. As you approach, the subtle elegance of its design seamlessly integrates with the surrounding landscape, boasting a facade adorned with verdant vegetation cascading down from the rooftop garden.Stepping through the threshold, you're greeted by an ambiance of tranquility and warmth, illuminated by an abundance of natural light filtering through strategically placed windows and skylights. The interior is a testament to thoughtful design, featuring an open-concept layout that effortlessly blends functionality with aesthetics.",
    "price": "$550,000",
    "status": "Sale",
    "area": "2000 sq ft",
    "location": "Portland, Oregon",
    "facilities": ["living room", "rooftop garden", "bike storage"]
  },
  {
    "image": "https://i.ibb.co/VHwhP09/usgbc-green-retirement-56a45f4b5f9b58b7d0d6a3ff.jpg",
    "estate_title": "Senior Living Community",
    "id": "8",
    "category": "Senior living communities",
    "description": "Community designed for seniors, offering a range of amenities and services for comfortable retirement living.",
    "deatailDescription": "Welcome to our vibrant and welcoming senior living community, where every day is an opportunity for enriching experiences and meaningful connections. Nestled in a serene and picturesque setting, our community offers a peaceful retreat from the hustle and bustle of city life while providing easy access to local amenities and conveniences.As you step onto our meticulously landscaped grounds, you'll be greeted by the sight of lush gardens, inviting walking paths, and charming outdoor seating areas where residents gather to enjoy the fresh air and sunshine. ",
    "price": "$3,000/month",
    "status": "Rent",
    "area": "3500 sq ft",
    "location": "Los Angeles, California",
    "facilities": ["living room", "dining area", "assistance services"]
  },
  {
    "image": "https://i.ibb.co/kGr5YHY/T735-Studierendenheim-Sheffield-Whittam-Cox-2.jpg",
    "estate_title": "Student Housing",
    "id": "9",
    "category": "Student housing",
    "description": "Modern student apartments near campus, featuring study lounges, fitness centers, and social spaces.",
    "deatailDescription": "Student Housing offers a haven for academic pursuits and community living. Our spacious and modern residences are designed to foster a dynamic environment where students can thrive both academically and socially. With a variety of floor plans to suit individual preferences, each unit is thoughtfully furnished and equipped with modern amenities to ensure comfort and convenience. From cozy study nooks to lively common areas, our facilities cater to every aspect of student life, promoting collaboration, relaxation, and personal growth. Beyond the walls of our residences, students have access to a wealth of campus resources, recreational facilities, and cultural opportunities, all within walking distance.",
    "price": "$1,200/month",
    "status": "Rent",
    "area": "2200 sq ft",
    "location": "Seattle, Washington",
    "facilities": ["bedroom", "study area", "shared kitchen"]
  },
  {
    "image": "https://i.ibb.co/HrWXsB9/nyc-brownstone-townhouses-hero.webp",
    "estate_title": "Historic Brownstone",
    "id": "10",
    "category": "Heritage Homes",
    "description": "Elegant brownstone with classic architectural details, situated in a historic neighborhood.",
    "deatailDescription": "Historic brownstone home stands as a timeless testament to an era gone by. Its elegant façade, adorned with intricate architectural details, beckons passersby to step inside and discover a world of refined charm and character. As sunlight dances through the large windows, illuminating the polished wooden floors and ornate moldings, each room tells a story of generations past, from the grandeur of the parlor with its marble fireplace to the cozy intimacy of the library lined with vintage leather-bound books. Up the winding staircase, the bedrooms offer a tranquil retreat, their high ceilings and period features blending seamlessly with modern comforts.",
    "price": "$900,000",
    "status": "Sale",
    "area": "3500 sq ft",
    "location": "Brooklyn, New York",
    "facilities": ["living room", "garden", "library"]
  },
  {
    "image": "https://a0.muscache.com/im/pictures/03b99bc7-f3e6-44c5-be75-57bb951b1077.jpg?im_w=1440",
    "estate_title": "Secluded Mountain Retreat",
    "id": "11",
    "category": "Single-family homes",
    "description": "Escape to this secluded mountain retreat, nestled among towering pines and breathtaking vistas.",
    "deatailDescription": "Nestled amidst the tranquil embrace of towering pines and cradled by the rugged majesty of the surrounding mountains, this secluded retreat home is a haven of serenity and natural beauty. Perched atop a verdant slope, the rustic charm of its weathered wooden exterior blends seamlessly with the untamed landscape, evoking a sense of timelessness and harmony with nature. As you approach, the gentle melody of a nearby stream greets you, its crystalline waters cascading over smooth stones in a harmonious symphony of sound. ",
    "price": "$1,200,000",
    "status": "Sale",
    "area": "3500 sq ft",
    "location": "Aspen, Colorado",
    "facilities": ["spacious living room", "fireplace", "mountain view"]
  },
  {
    "image": "https://cf.bstatic.com/xdata/images/hotel/max1024x768/424144870.jpg?k=ac0af595cd162a6b3b200d192735056d2c0f7741260d4860f53a749771451a78&o=&hp=1",
    "estate_title": "Charming Urban Loft",
    "id": "12",
    "category": "Apartments",
    "description": "Embrace city living in this charming urban loft, featuring exposed brick walls and industrial accents.",
    "deatailDescription": "Nestled in the heart of a serene suburban neighborhood lies a charming abode that exudes warmth and tranquility. As you approach, a neatly manicured lawn welcomes you, the emerald green grass dotted with vibrant blooms that sway gently in the soft breeze. The scent of freshly cut grass mingles with the sweet perfume of blossoms, creating an atmosphere of natural harmony.The exterior of the house, painted in a soothing shade of ivory, radiates timeless elegance. A quaint front porch adorned with wicker furniture invites you to pause and soak in the peaceful ambiance. Hanging baskets overflowing with cascades of flowers add a touch of whimsy, while the gentle creak of the porch swing promises moments of relaxation and reflection.",
    "price": "$600,000",
    "status": "Sale",
    "area": "1500 sq ft",
    "location": "San Francisco, California",
    "facilities": ["open kitchen", "city skyline view", "rooftop terrace"]
  },
  {
    "image": "https://cf.bstatic.com/xdata/images/hotel/max1280x900/371707701.jpg?k=e3be1a2344a98a1e1e12b6626e98d153e0f6d255078704855299333f6f17b87b&o=&hp=1",
    "estate_title": "Beachfront Paradise",
    "id": "13",
    "category": "Vacation Rentals",
    "description": "Indulge in beachfront luxury at this tropical paradise, where every day feels like a vacation.",
    "deatailDescription": "Beachfront Paradise home embodies the epitome of coastal living, offering a sanctuary where the rhythm of the waves becomes the soundtrack to everyday life. With panoramic views stretching as far as the eye can see, each sunrise paints the sky in hues of coral and gold, while the gentle sea breeze whispers secrets of distant shores. Step inside, where sun-kissed interiors seamlessly blend modern luxury with laid-back charm, inviting relaxation and rejuvenation. Floor-to-ceiling windows flood the space with natural light, illuminating the elegant furnishings and timeless coastal decor. The spacious living areas beckon for gatherings with loved ones, where laughter mingles with the sound of seagulls in the distance.",
    "price": "$400/night",
    "status": "Rent",
    "area": "2000 sq ft",
    "location": "Maui, Hawaii",
    "facilities": ["private beach access", "infinity pool", "oceanfront deck"]
  },
  {
    "image": "https://i.insider.com/5d66d8002e22af14406b83a6?width=700&format=jpeg&auto=webp",
    "estate_title": "Elegant Senior Living Residence",
    "id": "14",
    "category": "Senior living communities",
    "description": "Experience elegance and comfort in this upscale senior living residence, designed for a vibrant retirement lifestyle.",
    "deatailDescription": "Elegant Senior Living Residence embodies refined luxury and unparalleled comfort for those seeking a haven in their golden years. Stepping through its grand entrance, one is enveloped in an atmosphere of sophistication and warmth, where every detail speaks of timeless elegance. From meticulously manicured gardens to tastefully appointed interiors, each element is thoughtfully curated to elevate the resident experience. With spacious suites adorned with plush furnishings and expansive windows offering breathtaking views, residents are invited to unwind in style. The culinary delights served in the gourmet dining hall tantalize the senses, while the vibrant social calendar ensures days are filled with enriching activities and meaningful connections. ",
    "price": "$4,500/month",
    "status": "Rent",
    "area": "1800 sq ft",
    "location": "Palm Springs, California",
    "facilities": ["gourmet dining", "wellness center", "landscaped gardens"]
  },
  {
    "image": "https://images.trvl-media.com/lodging/35000000/34420000/34418300/34418248/6fb3a38e.jpg?impolicy=resizecrop&rw=1200&ra=fit",
    "estate_title": "Historic Townhouse in the Heart of the City",
    "id": "15",
    "category": "Townhouses",
    "description": "Live in luxury in this meticulously restored historic townhouse, centrally located for urban convenience.",
    "deatailDescription": "Historic townhouse stands as a timeless testament to elegance and charm. Its weathered facade, adorned with intricate architectural details, whispers tales of bygone eras, each step across its threshold a journey through history. Stepping inside, one is enveloped by a sense of grandeur, the spacious rooms echoing with the laughter and conversations of generations past. From the polished hardwood floors to the ornate crown moldings, every corner exudes an air of refined sophistication. Sunlight filters through stained glass windows, casting colorful patterns that dance across the walls, while antique furnishings and rich tapestries add a touch of old-world opulence.",
    "price": "$1,800,000",
    "status": "Sale",
    "area": "2800 sq ft",
    "location": "Boston, Massachusetts",
    "facilities": ["private courtyard", "chef's kitchen", "elevator"]
  },
  {
    "image": "https://www.americancampus.com/getmedia/38d900b0-e383-4469-97ca-9b04fbb621d1/695_Main-Hero_1440x576.jpg",
    "estate_title": "Modern Student Apartments",
    "id": "16",
    "category": "Student housing",
    "description": "Live in style and comfort at these modern student apartments, designed for academic success and socializing.",
    "deatailDescription": "Step into the epitome of contemporary student living with our modern student apartments, where each space is meticulously designed to harmonize comfort, style, and functionality. From the sleek lines of the furnishings to the vibrant hues adorning the walls, every detail has been carefully curated to create an atmosphere that inspires both productivity and relaxation. With open-concept layouts that maximize natural light and promote social interaction, our apartments foster a sense of community while offering ample privacy for individual study or downtime. Equipped with state-of-the-art appliances and high-speed internet connectivity, our residences cater to the demands of modern student life, ensuring seamless integration of work and leisure. ",
    "price": "$1,200/month",
    "status": "Rent",
    "area": "800 sq ft",
    "location": "Austin, Texas",
    "facilities": ["study lounge", "fitness center", "game room"]
  },
  {
    "image": "https://a0.muscache.com/im/pictures/ce7cfedd-42a5-4f74-a93b-6026116e9895.jpg",
    "estate_title": "Scenic Lakeside Cabin",
    "id": "17",
    "category": "Vacation Rentals",
    "description": "Escape to nature at this scenic lakeside cabin, where tranquility and relaxation await.",
    "deatailDescription": "Scenic Lakeside Cabin emerges like a storybook retreat, its weathered timber facade blending seamlessly with the verdant landscape that surrounds it. Perched upon the edge of a pristine lake, the cabin exudes a rustic charm, with its sloping roof adorned by a symphony of climbing vines and the occasional bird perched on its wooden eaves. A gentle breeze carries the scent of pine and wildflowers, while the sound of rustling leaves and lapping water creates a soothing melody that seems to echo through the air. Stepping inside, the warm embrace of the cabin's interior welcomes with the crackling of a wood-burning fireplace, casting a soft glow upon the cozy furnishings that invite relaxation.",
    "price": "$300/night",
    "status": "Rent",
    "area": "1200 sq ft",
    "location": "Lake Tahoe, California",
    "facilities": ["private dock", "deck with hot tub", "mountain views"]
  },
  {
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSkU3o6S8abJYOHjp2lDtaahfHGNWCgtzxgMPsfKwbqHQ&s",
    "estate_title": "Family-Friendly Suburban Home",
    "id": "18",
    "category": "Single-family homes",
    "description": "Settle into suburban bliss in this family-friendly home, with plenty of space for play and relaxation.",
    "deatailDescription": "Charming family-friendly home embodies comfort and tranquility at every turn. A symphony of warm hues and inviting architecture welcomes you, as manicured lawns and flourishing gardens paint a picturesque scene. Stepping inside, natural light dances through expansive windows, illuminating spacious living areas adorned with plush furnishings, perfect for gatherings or quiet evenings by the fireplace. The heart of the home, a modern kitchen, beckons with its gleaming countertops and state-of-the-art appliances, inspiring culinary creations and cherished family meals. ",
    "price": "$700,000",
    "status": "Sale",
    "area": "3200 sq ft",
    "location": "Charlotte, North Carolina",
    "facilities": ["backyard playground", "home theater", "gourmet kitchen"]
  }
]
